import numpy as np
import matplotlib.pyplot as plt

# 示例数据
x_axis = [0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1]  # 横坐标轴数据
y_axis = [0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9]  # 纵坐标轴数据
values = [[0.841, 0.843, 0.846, 0.845, 0.855, 0.837, 0.836, 0.8, 0.75, 0.76],
          [0.848, 0.851, 0.851, 0.855, 0.848, 0.853, 0.843, 0.824, 0.78, 0.77],
          [0.849, 0.844, 0.846, 0.853, 0.854, 0.851, 0.851, 0.848, 0.848, 0.79],
          [0.845, 0.846, 0.842, 0.848, 0.859, 0.856, 0.858, 0.858, 0.85, 0.8],
          [0.843, 0.847, 0.851, 0.843, 0.847, 0.848, 0.846, 0.855, 0.859, 0.863],
          [0.839, 0.85, 0.844, 0.846, 0.843, 0.853, 0.849, 0.853, 0.852, 0.857],
          [0.846, 0.84, 0.848, 0.846, 0.844, 0.837, 0.849, 0.84, 0.853, 0.856],
          [0.836, 0.845, 0.837, 0.838, 0.85, 0.848, 0.846, 0.847, 0.851, 0.845],
          [0.837, 0.84, 0.845, 0.839, 0.85, 0.848, 0.845, 0.855, 0.845, 0.849]]  # 横纵坐标对应的值

# 将数据转换为 NumPy 数组
x = np.array(x_axis)
y = np.array(y_axis)
z = np.array(values)

# 创建热图
plt.imshow(z, cmap='hot', interpolation='nearest', origin='lower')

# 添加轴标签和标题
plt.xlabel('Alpha')
plt.ylabel('Temp')
plt.title('cora')

# 在坐标轴上显示刻度标签
plt.xticks(range(len(x_axis)), x_axis)
plt.yticks(range(len(y_axis)), y_axis)

# 添加颜色条
plt.colorbar()

# 显示热图
plt.show()
